src/test/jmeter/Non_Static.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">This will create a new sampler every call.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="it_size" elementType="Argument">
            <stringProp name="Argument.name">it_size</stringProp>
            <stringProp name="Argument.value">${__P(iteration,3)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="depth_control" elementType="Argument">
            <stringProp name="Argument.name">depth_control</stringProp>
            <stringProp name="Argument.value">${__P(depth,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="thread_count" elementType="Argument">
            <stringProp name="Argument.name">thread_count</stringProp>
            <stringProp name="Argument.value">${__P(thread_count,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="encrypt" elementType="Argument">
            <stringProp name="Argument.name">encrypt</stringProp>
            <stringProp name="Argument.value">${__P(encrypt,false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="verify" elementType="Argument">
            <stringProp name="Argument.name">verify</stringProp>
            <stringProp name="Argument.value">${__P(verify,false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="multipart" elementType="Argument">
            <stringProp name="Argument.name">multipart</stringProp>
            <stringProp name="Argument.value">${__P(multipart,false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="duration" elementType="Argument">
            <stringProp name="Argument.name">duration</stringProp>
            <stringProp name="Argument.value">${__P(duration,60)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="size" elementType="Argument">
            <stringProp name="Argument.name">size</stringProp>
            <stringProp name="Argument.value">${__P(size,10489760)} </stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1509378840000</longProp>
        <longProp name="ThreadGroup.end_time">1509378840000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Create Directory" enabled="true">
          <stringProp name="TestPlan.comments">${__time(dd/MM/yyyy,)}</stringProp>
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="directoryName" elementType="Argument">
                <stringProp name="Argument.name">directoryName</stringProp>
                <stringProp name="Argument.value">${__time(dd_MM_yyyy_hh_mm,)}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="recursive" elementType="Argument">
                <stringProp name="Argument.name">recursive</stringProp>
                <stringProp name="Argument.value">true</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.joyent.jmetersampler.CreateDirectory</stringProp>
        </JavaSampler>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Getting Base Directory" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">baseDir</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..Directory</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Set the base directory" enabled="true">
          <stringProp name="BeanShellSampler.query">props.put(&quot;baseDir&quot;,vars.get(&quot;baseDir&quot;));
System.out.println(&quot;Base Dir : &quot; + vars.get(&quot;baseDir&quot;));</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Create File" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="size" elementType="Argument">
                <stringProp name="Argument.name">size</stringProp>
                <stringProp name="Argument.value">5242880</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="filename" elementType="Argument">
                <stringProp name="Argument.name">filename</stringProp>
                <stringProp name="Argument.value">foo.txt</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.joyent.jmetersampler.GenerateFile</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Main Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${thread_count}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1509141056000</longProp>
        <longProp name="ThreadGroup.end_time">1509141056000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${duration}</stringProp>
      </ThreadGroup>
      <hashTree>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Resetting the base directory" enabled="true">
          <stringProp name="BeanShellSampler.query">String directory = &quot;${__property(baseDir)}&quot;;
vars.put(&quot;baseDir&quot;, directory);
</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Iteration Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">iteration</stringProp>
          <boolProp name="CounterConfig.per_user">true</boolProp>
        </CounterConfig>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Creaete directory path" enabled="true">
          <stringProp name="BeanShellSampler.query">import java.text.DecimalFormat;

String directory = props.get(&quot;baseDir&quot;);
vars.put(&quot;baseDir&quot;, directory);

DecimalFormat threadFormatter = new DecimalFormat( &quot;0000&quot; );
DecimalFormat iterationFormatter = new DecimalFormat( &quot;000000&quot; );
DecimalFormat depthFormatter = new DecimalFormat( &quot;00&quot; );

int iteration = Integer.parseInt(vars.get(&quot;iteration&quot;));
int depth = Integer.parseInt(vars.get(&quot;depth_control&quot;));
int threadNumber = ctx.getThreadNum();

String baseDir = vars.get(&quot;baseDir&quot;);
String directoryName = directory;

for (int i=0;i&lt;depth;i++) {
    String sequence = threadFormatter.format(threadNumber) + &quot;-&quot; + iterationFormatter.format(iteration) + &quot;-&quot; + depthFormatter.format(i);
    directoryName = directoryName + &quot;/&quot; + sequence;
}
vars.put(&quot;directoryName&quot;,directoryName);</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Create Directory" enabled="true">
          <stringProp name="TestPlan.comments">${__time(dd/MM/yyyy,)}</stringProp>
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="directoryName" elementType="Argument">
                <stringProp name="Argument.name">directoryName</stringProp>
                <stringProp name="Argument.value">${directoryName}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="recursive" elementType="Argument">
                <stringProp name="Argument.name">recursive</stringProp>
                <stringProp name="Argument.value">true</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.joyent.jmetersampler.CreateDirectory</stringProp>
        </JavaSampler>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">${it_size}</stringProp>
        </LoopController>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Iteration Counter" enabled="true">
            <stringProp name="CounterConfig.start">1</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">fileCount</stringProp>
            <boolProp name="CounterConfig.per_user">true</boolProp>
            <boolProp name="CounterConfig.reset_on_tg_iteration">true</boolProp>
          </CounterConfig>
          <hashTree/>
          <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Upload File" enabled="true">
            <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="encrypted" elementType="Argument">
                  <stringProp name="Argument.name">encrypted</stringProp>
                  <stringProp name="Argument.value">${encrypt}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="multipart" elementType="Argument">
                  <stringProp name="Argument.name">multipart</stringProp>
                  <stringProp name="Argument.value">${multipart}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="splitSize" elementType="Argument">
                  <stringProp name="Argument.name">splitSize</stringProp>
                  <stringProp name="Argument.value">5242880</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="name" elementType="Argument">
                  <stringProp name="Argument.name">name</stringProp>
                  <stringProp name="Argument.value">obj_${fileCount}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="directory" elementType="Argument">
                  <stringProp name="Argument.name">directory</stringProp>
                  <stringProp name="Argument.value">${directoryName}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="filename" elementType="Argument">
                  <stringProp name="Argument.name">filename</stringProp>
                  <stringProp name="Argument.value">foo.txt</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="retries" elementType="Argument">
                  <stringProp name="Argument.name">retries</stringProp>
                  <stringProp name="Argument.value">1</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="maxConnections" elementType="Argument">
                  <stringProp name="Argument.name">maxConnections</stringProp>
                  <stringProp name="Argument.value">1</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="encryptionAlgorithm" elementType="Argument">
                  <stringProp name="Argument.name">encryptionAlgorithm</stringProp>
                  <stringProp name="Argument.value">AES256/CTR/NoPadding</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="verify" elementType="Argument">
                  <stringProp name="Argument.name">verify</stringProp>
                  <stringProp name="Argument.value">true</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="timeout" elementType="Argument">
                  <stringProp name="Argument.name">timeout</stringProp>
                  <stringProp name="Argument.value">10000</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="classname">com.joyent.jmetersampler.UploadFile</stringProp>
          </JavaSampler>
          <hashTree/>
        </hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Verify" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="directory" elementType="Argument">
                <stringProp name="Argument.name">directory</stringProp>
                <stringProp name="Argument.value">${directoryName}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="filter" elementType="Argument">
                <stringProp name="Argument.name">filter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.joyent.jmetersampler.AtomicDirectoryListing</stringProp>
        </JavaSampler>
        <hashTree>
          <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="BeanShell Assertion" enabled="true">
            <stringProp name="BeanShellAssertion.query">int count = Integer.parseInt(vars.get(&quot;it_size&quot;));
String responseBody = new String(ResponseData);
System.out.println(responseBody.indexOf(&quot;obj_&quot; + 0));

for(int i = 1;i &lt; count;i++) {
	String objName = &quot;obj_&quot; + i;
	if(responseBody.indexOf(objName) == -1) { 
		FailureMessage = &quot;Failed to find obj_&quot; + i;
		Failure = true;
	}
}
</stringProp>
            <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
          </BeanShellAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="Cleaning up the test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1509464128000</longProp>
        <longProp name="ThreadGroup.end_time">1509464128000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </PostThreadGroup>
      <hashTree>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Resetting the base directory" enabled="true">
          <stringProp name="BeanShellSampler.query">String directory = &quot;${__property(baseDir)}&quot;;
vars.put(&quot;baseDir&quot;, directory);
</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Delete Directory" enabled="true">
          <stringProp name="TestPlan.comments">${__time(dd/MM/yyyy,)}</stringProp>
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="directory" elementType="Argument">
                <stringProp name="Argument.name">directory</stringProp>
                <stringProp name="Argument.value">${baseDir}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.joyent.jmetersampler.DeleteDirectory</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Debug Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="TestPlan.comments">Here just to write the requests.xml file in whichever directory that you run this in.</stringProp>
        <stringProp name="filename">./requests.xml</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>